--https://dencode.com/ru/string/unicode-escape
utf8 = require ("plugin.utf8")

actions = {
   ['login'] = { 
      url = [[https://sd.sodrk.ru/ajax/user/login]],
      --попытка авторизации
      desc = utf8.escape('%x043F%x043E%x043F%x044B%x0442%x043A%x0430%x0020%x0430%x0432%x0442%x043E%x0440%x0438%x0437%x0430%x0446%x0438%x0438'),
      --успешная автризация
      succeed = utf8.escape('%x0443%x0441%x043F%x0435%x0448%x043D%x0430%x044F%x0020%x0430%x0432%x0442%x043E%x0440%x0438%x0437%x0430%x0446%x0438%x044F'),
      --ошибка авторизации
      failed = utf8.escape('%x043E%x0448%x0438%x0431%x043A%x0430%x0020%x0430%x0432%x0442%x043E%x0440%x0438%x0437%x0430%x0446%x0438%x0438'),
      signal = 'filter_build',
   },
   ['key'] = { 
      url = [[https://sd.sodrk.ru/ajax/user/key]],
      --получение ключа авторизации
      desc = utf8.escape('%x043F%x043E%x043B%x0443%x0447%x0435%x043D%x0438%x0435%x0020%x043A%x043B%x044E%x0447%x0430%x0020%x0430%x0432%x0442%x043E%x0440%x0438%x0437%x0430%x0446%x0438%x0438'),
      signal = 'login',
      --ошибка получения ключа авторизации
      failed = utf8.escape('%x043E%x0448%x0438%x0431%x043A%x0430%x0020%x043F%x043E%x043B%x0443%x0447%x0435%x043D%x0438%x044F%x0020%x043A%x043B%x044E%x0447%x0430%x0020%x0430%x0432%x0442%x043E%x0440%x0438%x0437%x0430%x0446%x0438%x0438'),
      --успешно получен ключ авторизации
      succeed = utf8.escape('%x0443%x0441%x043F%x0435%x0448%x043D%x043E%x0020%x043F%x043E%x043B%x0443%x0447%x0435%x043D%x0020%x043A%x043B%x044E%x0447%x0020%x0430%x0432%x0442%x043E%x0440%x0438%x0437%x0430%x0446%x0438%x0438'),
   },
   ['list_contragents'] = { 
      url = [[https://sd.sodrk.ru/ajax/dir/contragents]],
      --получение списка контрагентов
      desc = utf8.escape('%x043F%x043E%x043B%x0443%x0447%x0435%x043D%x0438%x0435%x0020%x0441%x043F%x0438%x0441%x043A%x0430%x0020%x043A%x043E%x043D%x0442%x0440%x0430%x0433%x0435%x043D%x0442%x043E%x0432'),
      --успешно получен список контрагентов
      succeed = utf8.escape('%x0443%x0441%x043F%x0435%x0448%x043D%x043E%x0020%x043F%x043E%x043B%x0443%x0447%x0435%x043D%x0020%x0441%x043F%x0438%x0441%x043E%x043A%x0020%x043A%x043E%x043D%x0442%x0440%x0430%x0433%x0435%x043D%x0442%x043E%x0432'),
      --не удалось получить список контрагентов
      failed = utf8.escape('%x043D%x0435%x0020%x0443%x0434%x0430%x043B%x043E%x0441%x044C%x0020%x043F%x043E%x043B%x0443%x0447%x0438%x0442%x044C%x0020%x0441%x043F%x0438%x0441%x043E%x043A%x0020%x043A%x043E%x043D%x0442%x0440%x0430%x0433%x0435%x043D%x0442%x043E%x0432'),
   },
   ['filter_build'] = { 
      url = [[https://sd.sodrk.ru/ajax/filter/build]],
      --построение фильтра заявок
      desc = utf8.escape('%x043F%x043E%x0441%x0442%x0440%x043E%x0435%x043D%x0438%x0435%x0020%x0444%x0438%x043B%x044C%x0442%x0440%x0430%x0020%x0437%x0430%x044F%x0432%x043E%x043A'),
      signal = 'filter_set',
      --успешно построен фильтр заявок
      succeed = utf8.escape('%x0443%x0441%x043F%x0435%x0448%x043D%x043E%x0020%x043F%x043E%x0441%x0442%x0440%x043E%x0435%x043D%x0020%x0444%x0438%x043B%x044C%x0442%x0440%x0020%x0437%x0430%x044F%x0432%x043E%x043A'),
      --ошибка построения фильтра заявок
      failed = utf8.escape('%x043E%x0448%x0438%x0431%x043A%x0430%x0020%x043F%x043E%x0441%x0442%x0440%x043E%x0435%x043D%x0438%x044F%x0020%x0444%x0438%x043B%x044C%x0442%x0440%x0430%x0020%x0437%x0430%x044F%x0432%x043E%x043'),
   },
   ['filter_set'] = { 
      url = [[https://sd.sodrk.ru/ajax/filter/set]],
      --установка фильтра заявок
      desc = utf8.escape('%x0443%x0441%x0442%x0430%x043D%x043E%x0432%x043A%x0430%x0020%x0444%x0438%x043B%x044C%x0442%x0440%x0430%x0020%x0437%x0430%x044F%x0432%x043E%x043A'),
      signal = 'ready',
      --успешно установлен фильр заявок
      succeed = utf8.escape('%x0443%x0441%x043F%x0435%x0448%x043D%x043E%x0020%x0443%x0441%x0442%x0430%x043D%x043E%x0432%x043B%x0435%x043D%x0020%x0444%x0438%x043B%x044C%x0442%x0440%x0020%x0437%x0430%x044F%x0432%x043E%x043A'),
      --ошибка установки фильтра заявок
      failed = utf8.escape('%x043E%x0448%x0438%x0431%x043A%x0430%x0020%x0443%x0441%x0442%x0430%x043D%x043E%x0432%x043A%x0438%x0020%x0444%x0438%x043B%x044C%x0442%x0440%x0430%x0020%x0437%x0430%x044F%x0432%x043E%x043A'),
   },
   ['test_request'] = { 
      --url = [[https://sd.sodrk.ru/ajax/request/new/f875d0a0-3fdc-11e9-ab5d-002590839a1d/502564a1-6de4-11e6-95f3-002590839a1d/medium/b30dd447-46fe-11e9-ab5d-002590839a1d]],
      url = [[https://sd.sodrk.ru/ajax/request/new/]],
      --создание заявки
      desc = utf8.escape('%x0441%x043E%x0437%x0434%x0430%x043D%x0438%x0435%x0020%x0437%x0430%x044F%x0432%x043A%x0438'),
      --заявка успешно создана
      succeed = utf8.escape('%x0437%x0430%x044F%x0432%x043A%x0430%x0020%x0443%x0441%x043F%x0435%x0448%x043D%x043E%x0020%x0441%x043E%x0437%x0434%x0430%x043D%x0430'),
      --при создании заявки произошла ошибка
      failed = utf8.escape('%x043F%x0440%x0438%x0020%x0441%x043E%x0437%x0434%x0430%x043D%x0438%x0438%x0020%x0437%x0430%x044F%x0432%x043A%x0438%x0020%x043F%x0440%x043E%x0438%x0437%x043E%x0448%x043B%x0430%x0020%x043E%x0448%x0438%x0431%x043A%x0430'),
      signal = 'request_complete',
   },
}

msg_config = "Loading config file"
msg_config_err = "Error loading config file"
--Произошла ошибка при отправке сообщения, попробуйте позднее
msg_error	= utf8.escape('%x041F%x0440%x043E%x0438%x0437%x043E%x0448%x043B%x0430%x0020%x043E%x0448%x0438%x0431%x043A%x0430%x0020%x043F%x0440%x0438%x0020%x043E%x0442%x043F%x0440%x0430%x0432%x043A%x0435%x0020%x0441%x043E%x043E%x0431%x0449%x0435%x043D%x0438%x044F%x002C%x0020%x043F%x043E%x043F%x0440%x043E%x0431%x0443%x0439%x0442%x0435%x0020%x043F%x043E%x0437%x0434%x043D%x0435%x0435%x000A')
msg_loading 	= utf8.escape('%x0417%x0430%x0433%x0440%x0443%x0437%x043A%x0430')
msg_success	= utf8.escape('%x0411%x043B%x0430%x0433%x043E%x0434%x0430%x0440%x0438%x043C%x0020%x0437%x0430%x0020%x043E%x0431%x0440%x0430%x0449%x0435%x043D%x0438%x0435%x0021')
--введите текст вашей заявки
msg_your_req 	= utf8.escape('%x0028%x0412%x0432%x0435%x0434%x0438%x0442%x0435%x0020%x0442%x0435%x043A%x0441%x0442%x0020%x0432%x0430%x0448%x0435%x0439%x0020%x0437%x0430%x044F%x0432%x043A%x0438%x0029')
--введите номер телефона для связи
msg_your_req_phone 	= utf8.escape("%x0028%x0412%x0432%x0435%x0434%x0438%x0442%x0435%x0020%x043d%x043e%x043c%x0435%x0440%x0020%x0442%x0435%x043b%x0435%x0444%x043e%x043d%x0430%x0020%x0434%x043b%x044f%x0020%x0441%x0432%x044f%x0437%x0438%x0029")

--подать заявку
msg_send_req 	= utf8.escape('%x043F%x043E%x0434%x0430%x0442%x044C%x0020%x0437%x0430%x044F%x0432%x043A%x0443')
msg_restart 	= utf8.escape('%x041F%x043E%x0432%x0442%x043E%x0440%x043D%x043E%x0435%x0020%x043E%x0431%x0440%x0430%x0449%x0435%x043D%x0438%x0435')
--
msg_no_contact_phone = utf8.escape("%x041f%x043e%x0436%x0430%x043b%x0443%x0439%x0441%x0442%x0430%x002c%x0020%x0443%x043a%x0430%x0436%x0438%x0442%x0435%x0020%x0441%x0432%x043e%x0439%x0020%x043a%x043e%x043d%x0442%x0430%x043a%x0442%x043d%x044b%x0439%x0020%x043d%x043e%x043c%x0435%x0440%x0020%x0434%x043b%x044f%x0020%x0441%x0432%x044f%x0437%x0438%x002e")
msg_no_text = utf8.escape("%x041f%x043e%x0436%x0430%x043b%x0443%x0439%x0441%x0442%x0430%x002c%x0020%x0443%x043a%x0430%x0436%x0438%x0442%x0435%x0020%x0442%x0435%x043a%x0441%x0442%x0020%x0441%x0432%x043e%x0435%x0433%x043e%x0020%x043e%x0431%x0440%x0430%x0449%x0435%x043d%x0438%x044f%x002e")
